import { Layout } from "../../components/Layout";

export function GlossaryScreen() {
  return (
    <Layout activeLink="glossary">
      <main className="main">
        <h1 className="main__title">Глоссарий</h1>
        <p>
          Веретенники - род крупных болотных птиц семейства бекасовых с очень
          длинным клювом и длинными ногами. Ворчать - произносить фразы,
          издавать звуки негромким тихим голосом, выражая своё раздражение.
        </p>
        <p>
          Вспыльчивый - способность легко приходить в раздражение, гнев,
          озлобление.
        </p>

        <p>Дудаки - крупная птица семейства дрофиных. </p>
        <p>Знойный - горячий, палящий, раскаленный, жаркий. </p>
        <p>
          Караван - группа вьючных животных, перевозящих грузы, людей (в
          пустыне, в степи).{" "}
        </p>
        <p>Карниз - выступ в верхней части здания, над окном, дверью.</p>
        <p>
          Королек - очень мелкая птица, своим шарообразным сложением похожая на
          пеночек, с очень коротким хвостом, короткой шеей и большой головой.{" "}
        </p>
        <p>
          Кречетка - редкая птица размером чуть больше голубя, которая гнездится
          только в Казахстане и в южной части России.
        </p>
        <p>
          Кроншнепы - очень яркие представители семейства бекасовых, их легко
          узнать по длинным, слегка изогнутым вниз клювам.
        </p>
        <p>
          Кроткий - отходчивый нрав человека, умение контролировать эмоции,
          готового осознанно прощать ошибки и обиды от других.
        </p>
        <p>
          Лагуна- мелкий водоём, отделённый от большей части воды барьерными
          островами или рифами.
        </p>

        <p>Лирика- вид поэзии, выражающий чувства и переживания поэта. </p>
        <p>
          Одряхлеть- стать дряхлее, сделаться дряхлым; обветшать, устареть,
          стать под старость хилым, хворым и слабым.{" "}
        </p>
        <p>
          Пеночка - род мелких насекомоядных птиц, единственный в семействе
          пеночковых, обитающих в Европе, Азии и Африке.{" "}
        </p>
        <p>Пожухлый - увянувший, увядший, засохший.</p>
        <p>Приободрился - ободриться, приобрести немного бодрости.</p>
        <p>Прутик - тонкая отломанная, отломившаяся ветка без листьев.</p>
        <p>
          Путник - странник; тот, кто находится в пути; идёт или едет куда-либо.
        </p>
        <p>Свирепеть- становиться свирепым или более свирепым.</p>
        <p>Смекнуть- понять что-либо, разобраться в чём-либо.</p>
        <p>
          Стрепеты - это коренастая птица из семейства дроф, отличающаяся
          характерным рисунком шеи в брачном оперении.
        </p>
        <p>
          Тиркушки- род птиц из семейства тиркушковых. Птицы средней величины.
          Распространены в пустынях, степях и полупустынях Африки, Азии, Европы,
          Австралии.
        </p>
      </main>
    </Layout>
  );
}
